// Напишите программу, которая принимает на вход принимает число и выдаёт, является ли число чётным
// (делится ли оно на два без остатка)
// Пример:
// 4 -> да
// -3 -> нет
int a = 9;

Console.Write("Введите число: ");
if (a % 2 == 1)
{
    Console.WriteLine("Нет");
}
else
{
    Console.WriteLine("Да");
}